{"judul":"Apa saja yang bisa kamu lakukan dalam sejam?","deskripsi":"Kalau kita fokus...","isi":"Berapa waktu yang kita miliki dalam sehari?\n\n```go\npackage main\nimport \"fmt\"\nfunc main(){\n tidur := 8\n waktu := 24 - tidur\n fmt.Println(waktu)\n // hasil: 16\n}\n```\n\nKalau dari logika di atas kan, kita punya 16 jam dalam seharinya untuk aktif bekerja dan melakukan kegiatan apapun. Jika satu jam itu diibaratkan dengan satu slot, maka, kita punya 16 slot dalam sehari semalam untuk aktif melakukan sesuatu.\n\nNah, sekarang pertanyaannya adalah dalam satu jam itu kita bisa ngapain aja? Pertama, aku bertanya kepada kawan-kawan di grup WhatsApp Sanggar Baca Caraka. Di situ, [Mbak Nimas](https://www.nimasachsani.my.id/?m=1) menjawab:\n\n> Tergantung mas\n> Aku JK Rowling/Dan Brown, sehari bisa +- 500 halaman (tanpa distraksi)\n\nWeh. Dalam satu hari bisa membaca 500 halaman. Itu jumlah yang sangat besar\n\nLalu, kalau membaca Qur'an, berdasarkan pengalaman kawan-kawan di [Ma'had Tahfidzul Qur'an Isy Karima](https://isykarima.com/), dalam sejam bisa membaca dua juz, baik itu secara nadzar (melihat Quran) maupun bil gaib (tanpa melihat Quran). Maka, dalam sehari, bisa **mengkhatamkan Quran**! Hebat banget ya. Kita aja kadang sebulan nggak mesti khatam. Khatam Qurannya cuma kalau bulan Ramadan aja. Eh ternyata kalau kita fokus dalam membaca Qur'an, sehari aja bisa khatam.\n\nKalau menulis buku, menurut Mbak Dede:\n\n> Saya cuma 350 kata, Kak...\n\nBeh. 350 kata itu setara dengan 1 halaman buku. Maka, dalam satu hari, kita bisa menulis buku sebanyak **8 lembar**!\n\nJadi, kalau kita kumpulkan tu seperti ini:\n\n**_Kalau sehari aja fokus..._**\n\n| Kegiatan | Kuantitas |\n|---|---|\n| Membaca | 500 halaman |\n| Ngaji | Khatam |\n| Menulis | 8 lembar |\n\nSungguh pencapaian yang sangat luar biasa jika kita bisa sehari aja fokus untuk melakukan salah satu dari kegiatan di atas.\n\n## Kalau kita fokus\n\nTerlihat dari survey kecil-kecilan di atas, kalau kita bisa fokus, maka banyak hal yang bisa kita lakukan. Kita lihat aja deh, betapa susahnya kita mengkhatamkan Quran selama bulan Ramadan. Padahal, kalau kita fokus aja, sebentar aja ternyata mengkhatamkan Quran. Atau, kita mengeluh betapa susahnya mengkhatamkan bacaan buku. Padahal, kalau fokus, bisa 500 halaman kita baca dalam sehari!\n\n## Kisah tentang ulama dan kefokusannya\n\nAku teringat dengan salah seorang ulama yang dia itu fokus banget dengan menuntut ilmu. Aku lupa namanya siapa, soalnya aku Googling belum ketemu. Ntar kasih tau ya kalau kamu tau siapa namanya.\n\nNah, ulama ini saking semangatnya menuntut ilmu, dia nggak pernah mau lepas dari membaca. Apalagi kan yang dipelajarinya itu adalah ilmu agama yang merupakan suatu kebutuhan oleh semua orang, maka, ulama ini makin semangat lagi dalam mempelajarinya. \n\nNah, saking semangatnya dalam belajar, beliau sampai mandi aja, minta ke santrinya buat bacakan kitab yang sedang dipelajarinya itu dari luar kamar mandi. Kan, yang namanya kitab itu nggak boleh dibawa ke kamar mandi. Alasannya ya, _1_) untuk menghormati kitab, _2_) kalau ada ayat Qur'an, nggak mendapat murka dari Allah karena membawa ayat-Nya ke kamar mandi.\n\nKemudian, untuk makan aja, beliau nggak makan kayak kita ni. Jadi, makanannya itu dibuatnya jadi bubur. Sehingga, waktu untuk mengkonsumsi makanan itu jadi lebih cepat. Sebegitunya ya saking nggak mau lepasnya sama ilmu.\n\n## Ilmu dan kebangkitan Islam\n\nAda suatu ulasan menarik di Youtubenya [Inspect History](https://youtu.be/tIZgdmFzt4A) tentang sebab-sebab yang membuat Islam menjadi jaya pada zamannya itu. Jadi, di situ dijelaskan bahwa yang membuat Islam menjadi jaya adalah betapa perhatiannya pada Khalifah kepada ilmu. Di situ diceritakan tentang Khalifah Harun Ar-Rasyid yang mendirikan Baitul Hikmah atau rumah kebijaksanaan, tempat di mana setiap ilmuan di seluruh penjuru dunia menyalurkan ilmunya di situ. Mereka saling berdiskusi, menelaah, membaca, dan menulis. Kemudian, dilanjutkan oleh Khalifah Makmun yang semakin gencar menerjemahkan manuskrip Yunani dan Romawi ke dalam bahasa Arab. Karena berkembangnya ilmu itulah, semakin jaya juga kekhalifahan pada masa itu.\n\nNah, berarti kan ketika kita semua mampu membaca lebih banyak buku, **menulis** lebih banyak lagi, kita semua bisa menyumbangkan peninggalan kita ini untuk mengembalikan kejayaan di muka bumi ini, di mana nggak ada lagi kebodohan, kelaparan, dan penindasan."}