{"judul":"Apakah amal muta'addi lebih unggul jika dibandingkan amal qasir?","deskripsi":"Tadi khutbah Jumat bahas ini sih","isi":"Amal muta'addi adalah amal-amal yang berkaitan dengan orang lain seperti sedekah, membantu orang lain, membantu melunasi utang orang lain, memperpanjang tenggat waktu pembayaran utang, dan lain sebagainya. Sedangkan amal qasir adalah amal-amal yang berkaitan hanya dengan diri sendiri seperti shalat, sedekah, infaq, dan lain sebagainya. Lalu, apakah amal muta'addi lebih unggul daripada amal qasir?\n\nKalau kata khatib tadi sih _iya_, dengan menggunakan berbagai hadits Nabi shallallahu alaihi wa sallam (yang aku cari di Google, nggak ketemu tadi. Soalnya kan jumatan nggak boleh bawa catatan. Jadi, nggak kucatat tadi). Misalnya aja hadits tentang orang yang alim jika dibandingkan dengan abid adalah seperti rembulan di tengah malam dibandingkan dengan berbagai bintang di sekitarnya. Lalu, ada pula hadits yang menyatakan bahwa orang yang membantu orang lain itu lebih mulia daripada shalat di masjid nabawi selama sebulan. Tapi sayang sih, aku belum nemu hadits-haditsnya.\n\nTapi, hal yang menarik diungkapkan oleh [website Al-Muslim](http://almoslim.net/naser/285768) yang menyatakan bahwa sebenarnya nggak perlu sih membeda-bedakan antara amal muta'addi dengan amal qasir karena semua amal itu baik di sisi Allah. Berikut adalah terjemahannya:\n\nهناك بعض الأوهام المتعلقة بمفهوم العمل المتعدي والقاصر، والمقصود بالعمل المتعدي هو ما يتعدَّى نفعُه صاحبَه إلى غيره، كالدعوة إلى الله، وتعليم العلم، والأمر بالمعروف والنهي عن المنكر، وقضاء حوائج الناس، والنفقة؛ أما الفعل القاصر فهو ما اقتصر نفعه على صاحبه كقراءة القرآن والصلاة والصيام والذكر.\n\n_Terdapat beberapa kesalahpahaman konsep yang berkaitan dengan amal muta'addi dengan amal qasir, amal muta'addi adalah segala amal yang manfaatnya berkaitan dengan pelakunya dan orang lain, seperti dakwah kepada Allah, mengajarkan ilmu, amar ma'ruf dan nahi munkar, memenuhi kebutuhan manusia, dan berinfaq; sedangkan amal qasir yaitu yang manfaatnya hanya berkaitan dengan pelakunya seperti membaca Quran, shalat, puasa, dan dzikir._\n\nحتى إن بعضهم بسبب هذا الوهم يقول: ليت ابن تيمية اشتغل بالتأليف بدل جلوسه لذكر الله من بعد صلاة الفجر إلى الضحى، فإنه عمل قاصر. وهذا بلا شك خطأ محض وفهم قاصر، فهذه الجلسة ونظائرها من العبادات هي التي أعانته على الجهاد الحقيقي، بالسيف والسنان، والقلم واللسان، إلى أن لقي ربه عالماً عاملاً رحمه الله.\n\n_Kesalahpahaman konsep ini menyebabkan beberapa orang berkata: Seandainya saja Ibnu Taimiyah menyibukkan dirinya untuk menulis kitab menggantikan duduknya untuk berdzikir kepada Allah dari shalat Subuh sampai waktu Dhuha, karena itu hanyalah amal qasir. Maka, tidak diragukan lagi bahwa ini adalah sebuah kesalahan dan pemahaman yang sempit, maka duduknya dalam beribadahlah yang membantunya dalam berjihad yang sesungguhnya, menggunakan pedang dan gigi, dengan pena dan lisan, hingga ia bertemu kepada Tuhannya dengan ilmunya dan amalnya (semoga Allah merahmatinya)._\n\nولا شك أن الأصل في نفع الأعمال المسماة قاصرة يعود على صاحبها بالدرجة الأولى، ولكن هذا لا يعني بحال أن النفع لا يجاوزه إلى غيره.\n\n_Maka tidak ada keraguan lagi bahwasanya inti dari manfaat suatu amal yang dinamakan qasir kembali kepada pelakunya saja, akan tetapi bukan berarti bahwa manfaatnya tidak ada buat orang lain._\n\nفهذا خلاف الصواب نقلاً وعقلاً، أما نقلاً فقد قال الله سبحانه وتعالى: {يَا أَيُّهَا الَّذِينَ آَمَنُوا إِذَا لَقِيتُمْ فِئَةً فَاثْبُتُوا وَاذْكُرُوا اللَّهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ} [الأنفال]، فعلَّق الفلاح والغلبة على العدو بالثبات والذكر، فدلَّ أن نفع الذكر ليس قاصراً على صاحبه، بل يتعداه إلى باقي المؤمنين، والذي يقطع كل شك حول هذه النقطة قوله صلى الله عليه وسلم: «إنما ينصر الله هذه الأمة بضعيفها، بدعوتهم وصلاتهم وإخلاصهم»(1)، فبيَّن –عليه السلام- أن نصر هذه الأمة بدعوة الضعفاء وصلاتهم وإخلاصهم، بل عظَّم من شأنها فاستخدم أداة الحصر \"إنما\"، كأن النصر لا يكون إلا بذلك، فهل يصح بعد ذلك أن يُقال: إن الصلاة والإخلاص من الأعمال القاصرة بالمفهوم المتقدم؟\n\n_Maka kebalikan ini adalah benar baik secara dalil nash maupun akal, adapun secara dalil nash, Allah subhanahu wa taaala telah berfirman: Wahai orang-orang yang beriman, jika kamu bertemu dengan suatu kelompok (kelompok musuh dalam peperangan), maka teguhlah dan berdzikirlah kepada Allah dengan dzikir yang banyak supaya kamu menang (Al-Qur'an surat Al-Anfal). Maka, Allah mengaitkan antara kemenangan dan mengalahkan musuh dengan berteguh hati dan berdzikir. Maka, ini adalah dalil bagi manfaat dzikir bukan hanya terbatas bagi pelakunya, melainkan juga bermanfaat bagi orang-orang beriman lainnya._\n\n_Kemudian, yang menghilangkan keraguan atas semua ini adalah sabda Nabi shallallahu alaihi wa sallam: Sesungguhnya hanya orang-orang dhaiflah yang membuat Allah menolong umat ini, dengan doa mereka, shalat mereka, dan keikhlasan mereka. (Sunan An-Nasa'i 6/45 [3178] dan dishahihkan oleh Al-Albani). Maka, Nabi shallallahu alaihi wa sallam menjelaskan bahwasanya pertolongan atas umat ini adalah dikarenakan oleh doanya para dhuafa, shalat mereka, dan keikhlasan mereka. Kemudian, dikuatkan lagi dengan lafadz `innama` yang artinya bahwa pertolongan nggak akan datang kecuali dengan sebab-sebab tersebut. Lalu, apakah tepat pernyataan: Sesungguhnya shalat dan ikhlas hanyalah amal qasir sebagaimana yang dipahami oleh orang-orang saat ini?_\n\nوقد فهمت الأمم قديماً ذلك؛ فقال قوم شعيب عليه السلام لنبيهم: {قَالُوا يَا شُعَيْبُ أَصَلَاتُكَ تَأْمُرُكَ أَنْ نَتْرُكَ مَا يَعْبُدُ آَبَاؤُنَا أَوْ أَنْ نَفْعَلَ فِي أَمْوَالِنَا مَا نَشَاءُ} [هود:87]، فعلموا أن الصلاة يتعدى نفعها إلى إصلاح العقيدة والمال، فأي نفع أعظم من ذلك، ولذلك قال سبحانه: {إِنَّ الصَّلَاةَ تَنْهَى عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ وَلَذِكْرُ اللَّهِ أَكْبَرُ} [العنكبوت: 45].\n\n_Maka, seperti itu pulalah yang dipahami oleh umat-umat terdahulu; maka berkata qaumnya Syuaib alaihissalam kepada nabi mereka: Mereka berkata, Wahai Syuaib, apakah shalatmu (agamamu) yang menyuruhmu agar kami meninggalkan apa yang disembah nenek moyang kami atau melarang kami mengelola harta kami menurut cara yang kami kehendaki? (Al-Qur'an surat Hud ayat 87). Maka ketahuilah bahwa sesungguhnya shalat itu bermanfaat kepada perbaikan aqidah dan harta, maka manfaat apa lagi yang lebih besar daripada itu? Maka, Allah subhanahu wa taala berfirman: Sesungguhnya shalat itu mencegah dari perbuatan keji dan munkar, dan dzikir kepada Allah itu lebih besar (lebih agung) (Al-Qur'an surat Al-Ankabut ayat 45)._\n\nأما عقلاً فإن لهذه الأعمال المسماة بالقاصرة أثراً لا يُنكر على صاحبها، حيث تصقل شخصيته، وتصفي ذهنه، وتعطيه عوناً كبيراً على أداء واجبات الدعوة والتعليم وغيرها من الأفعال المتعدية، كما أنها تهذِّب أخلاقه، وتضبط تصرفاته، وتنظِّم حركاته وسكناته، فيكون داعية بفعله قبل كلامه، وهذا أدعى للتأثير في المحيط، وأرجى لقبول النصح منه والإرشاد؛ بل بكونه قدوة لمن بعده، وانظر كيف وجَّه النبي أمَّته إلى صلاة داود - عليه السلام – وصيامه؛ فجعله قدوة في ذلك مبيناً أنه لا أفضل من صلاة وصيام داود تطوعاً. أليس هذا من أعظم العمل المتعدي؟!\n\n_Adapun secara logika, bahwa sesungguhnya amal-amal yang tadi dikatakan sebagai amal qasir itu membekas kepada pelakunya, kemudian akan memperbaiki kepribadiannya, lalu menjernihkan pikirannya, yang akan memberikan bantuan yang besar kepada pemenuhan kewajiban dakwah, pendidikan, dan lainnya dari segi amal muta'addi, sebagaimana dia akan memperbaiki akhlak, mengendalikan tindakannya, dan mengatur pergerakannya dan diamnya, sehingga akan menjadi seorang dai yang amalnya lebih dahulu daripada perkataannya, dan dakwah ini akan memberikan kesan yang membekas, sehingga mudah diterimanya berbagai nash dan nasehat, maka dengan kepribadiannya ini, dia akan menjadi contoh bagi orang-orang setelahnya. Maka, lihatlah bagaimana Nabi shallallahu alaihi wasallam memberi tau umatnya tentang shalatnya Nabi Daud alaihissalam dan puasanya. Maka, dia menjadi contoh yang jelas bahwa tidak ada yang lebih utama dari shalat sunnahnya dan puasa sunnahnya Nabi Daud. Bukankah ini lebih agung daripada amal muta'addi?_"}