{"judul":"Harapanku pada Blogger Squad ODOP","deskripsi":"Harapanku...","isi":"![Harapan](https://i.ibb.co/kH3WCpR/undraw-choosing-house-v37h.png)\n\nAku nggak biasa mengharap pada sesuatu atau pada siapapun karena aku tau, terkadang, apa yang terjadi tidak sesuai dengan apa yang kita harapkan.\n\nNamun, harapan tetap kita perlukan agar kita tetap memiliki apa yang ingin kita capai. Ya, tentu saja aku pun memiliki harapan terhadap kontribusiku yang mungkin nggak seberapa di grup ini. Maka, harapanku adalah:\n\n- Ingin menuangkan ide yang ada di pikiranku ke dalam sebuah blog\n- Ingin membangun jaringan di dunia maya\n- Ingin mendapatkan pendapatan dari blog\n\nNamun, ternyata untuk mendapatkan itu semua, ada berbagai tahapan yang harus dilalui, ada proses-proses yang terkadang membuat kita malas melaluinya jika tugasnya itu sangat mudah. Namun, juga menjadi pusing rasanya kalau tugasnya itu sangat susah. Tapi, kalau kita mengerjakannya secara bersama-sama, artinya, kalau ada tugas langsung dikerjakan, rasanya tu nggak terlalu berat karena seperti \"berjuang\" bersama-sama.\n\nAkhirnya, di sinilah aku sekarang, di puncak perjalanan bersama kawan-kawan Blogger Squad ODOP, di mana sebentar lagi, kita akan bertemu dengan kawan-kawan baru yang akan bergabung. Memang terasa berat untuk bertemu ujung dari perjalanan ini walaupun memang kita akan bertemu dengan orang-orang baru lagi.\n\nLalu, bagaimana harapan-harapanku yang sudah kusebutkan di awal tadi? Kayaknya ada baiknya aku ulas satu per satu di sini.\n\nBERWUJUD DARI IDE MENJADI BLOG\n\nIde kalau nggak dituangkan, maka akan meluap. Ide adalah makhluk mistis yang sangat berharga namun waktunya singkat. Orang mencari-cari ide. Namun, ketika ide itu muncul, nggak semua orang sadar untuk menuangkannya ke dalam tulisan. Akhirnya, ide itu meluap.\n\nIde itu berharga. Ketika dia hilang, takkan kembali. Itulah mengapa aku menuliskannya supaya tak lenyap.\n\nJARINGAN DUNIA MAYA\n\nBerjejaring dengan para blogger artinya membuka hubungan pertemanan dunia maya. Memang, aku nggak biasa berinteraksi dengan orang lain (kecuali mungkin kalau hubungan bisnis dan pekerjaan). Nah, dengan berjejaring dengan kawan-kawan blogger, mungkin aku bisa melatih bersosial dengan orang lain.\n\nPENDAPATAN\n\nDulu aku taunya kalau pendapatan blogger itu ya cuma Adsense. Dan memang Adsense itu susah buat ngumpulin banyak kecuali memang kita punya pengunjung yang banyak. Namun, ternyata banyak cara mengumpulkan uang dari blog. Salah satunya adalah content placement.\n\nItu harapan-harapanku pada Squad Blogger ODOP dan memang sudah terwujud."}