{"judul":"Khilafah itu perlu","deskripsi":"Apa salahnya membicarakan ideologi?","isi":"Mungkin beberapa orang dari kita sudah ngeri duluan ya ngelihat judulnya yang berbau _khilafah_. Ya begitulah. Memang yang namanya stigma itu melekat kuat pada benak setiap kita. Sama pula seperti ketika ada orang membahas tentang komunisme, fasisme, sosialisme, dan berbagai idealisme asing lainnya, yang kita sendiri belum mengenalnya tapi sudah dibuat takut oleh orang-orang.\n\n> Belajar aja nggak papa kan?\n\nAda yang bilang bahwa manusia selalu takut dengan segala sesuatu yang nggak dipahaminya. Nah, bisa jadi kita ini takut dengan khilafah karena kita itu nggak paham khilafah itu apa. Cuma ikut-ikutan orang aja. Orang lain memusuhi khilafah, kita ikut-ikutan memusuhi. Padahal kan nggak ada yang menakutkan dengan yang namanya khilafah itu. Kita aja yang sudah ngeri duluan dengan nama khilafah.\n\nKhilafah itu hanyalah suatu sistem pemerintahan. Ya kayak sistem-sistem pemerintahan lainnya di muka bumi ini. Sekarang kan yang berlaku itu sistem pemerintahan demokratis yang menganut konsep _dari rakyat, oleh rakyat, untuk rakyat_ dan ada pula yang mengatakannya sebagai _suara rakyat adalah suara Tuhan_. Hal ini berasal dengan suatu filsafat dari Yunani yang mengatakan bahwa _manusia diatur oleh manusia_. Aku siapa nama filsuf yang menyatakan ini. Tapi yang jelas, itu adalah salah satu pondasi dari demokrasi.\n\nLalu, dulu kita mengenal dengan yang namanya sistem pemerintahan kerajaan di mana suatu negara dipimpin oleh seorang raja. Dan perintah raja adalah mutlak. Sekarang ini, yang masih menganut sistem kerajaan adalah Arab Saudi. Dia bentuknya kerajaan sekaligus _monarki heredities_. Artinya, raja berikutnya adalah anak dari raja saat ini. Aku nggak terlalu paham sih apakah di Saudi itu memang bentuk kerajaan mutlak atau ada sistem demokrasinya.\n\nNah, lalu di negara manakah yang menerapkan sistem khilafah? Nggak ada! Aneh sih ya. Bukankah semua sistem pemerintahan sudah diterapkan oleh berbagai negara? Seperti yang sudah kubahas di atas, demokrasi dipakai oleh banyak negara termasuk Indonesia, kerajaan dipakai oleh Saudi, komunisme dipakai oleh Tiongkok, Korea Utara, dan Rusia (tentunya dengan berbagai modifikasi). Semua sistem pemerintahan sudah dipakai, kenapa khilafah nggak dipakai?\n\nMungkin bisa jadi semua negara mengikuti aturan Amerika yang menyatakan bahwa:\n\n> Nggak boleh negara yang berasaskan pada aturan Tuhan.\n\nItu tertuang di undang-undangnya Amerika Serikat (nanti aku cari referensinya).\n\nApakah semua negara mengikuti Amerika Serikat karena dia menggunakan teknik _big stick diplomacy_ supaya negara-negara lain nurut dengan dia? Atau memang khilafah ini memang sudah dicap sebagai musuh semua negara sehingga tak ada lagi yang mau menggunakannya?\n\n## Mengapa khilafah?\n\nKhilafah itu sederhananya adalah **aturan Allah untuk manusia, dijalankan**. Sudah. Sesimpel itu aja definisinya. Nggak pakai ribet. Ketika Allah memerintahkan kita untuk shalat ya shalat. Ketika Allah memerintahkan kita untuk sedekah ya sedekah. Ketika Allah memerintahkan kita untuk jihad ya jihad. Simpel kan?\n\nTapi, mengapa ditolak?\n\nBisa jadi karena kita selama ini merasa nggak mampu mengikuti apa yang diinginkan oleh Allah sehingga kita belum berani menggunakannya. Atau, kita merasa bahwa sepertinya aturan Allah nggak bisa digunakan untuk selain umat Islam. Atau memang kita nggak punya niatan untuk taat padaNya?\n\nSemalam (8/10/2020), aku bermimpi tentang [kematian](/apa-yang-sudah-kita-persiapkan-untuk-menghadapi-kematian). Aku bermimpi bahwa aku sudah memejamkan mata dan detik-detik terakhir saja hingga kematian menjemputku. Aku merasa sudah siap. Tapi...\n\n> Entah mengapa aku merasa **nggak akan pernah siap!**\n\nApa amal yang sudah aku persiapkan? Apa aku sudah siap untuk benar-benar menjalani sakitnya dan tersiksanya kematian untuk menghadap kepadaNya?"}