{"judul":"Membuat server SPA dengan Go","deskripsi":"Server Go untuk framework Javascript","isi":"Dunia pemrograman website saat ini mengenal ada dua kutub utama yaitu dunia backend dan dunia frontend. Dunia backend adalah mengatur logika bisnis suatu aplikasi, apakah dia harus ditambah, dikurang, modulus, koneksi database A, atur transaksi kartu kredit dengan API bank B, dan begitu seterusnya. Sedangkan kalau dunia frontend, mengatur tampilan website kepada user. Nah, kalau di frontend ini lagi ramai yang namanya framework Javascript seperti Vue dan Angular, library Javascript seperti React, dan compiler Javascript seperti Svelte. Satu hal yang membuat khas dari berbagai teknologi frontend Javascript ini adalah penggunaan router untuk pengelolaan halaman-halamannya. Jadi, misalnya kita melihat di URL:\n\n- situs.com\n- situs.com/hello-world\n- situs.com/guesbook\n\nDan segala macamnya, itu sebenarnya hanya satu file `index.html` yang memberikan tampilan halaman yang berbeda-beda sesuai dengan URL yang muncul. Jadi, semua halaman di satu website, ittu semua ditumpuk di satu buah file `index.html`. Itulah yang namanya SPA (single page application). Keunggulan dari SPA ini adalah website menjadi lebih cepat dan transisi antar halamannya terasa lebih halus karena ya sebenarnya yang dibuka itu cuma satu file aja, yaitu `index.html`. Dan ketika kita klik-klik, yang seolah-olah berpindah halaman itu ya sebenarnya masih di `index.html` aja dan yang berubah hanya tampilannya, menyesuaikan dengan URLnya. Keren ya? Nah, sekarang kita akan bahas cara membuat servernya dengan Go.\n\nJadi, kita akan membuat server static file yang memiliki fitur SPA. Pertama, pastikan dulu kamu sudah punya Go ya. Kalau belum, install dulu. Monggo dicari di Google, gimana cara installnya.\n\nLalu, jalankan perintah berikut:\n\n```bash\ngo get github.com/roberthodgen/spa-server\n```\n\nItu fungsinya adalah untuk mendownload library Go bernama SPA Server yang dibuat oleh roberthodgen. Kenapa kita perlu library ini? Ya karena di library ini ada fitur untuk membuat sebuah server Go menjadi SPA, artinya, apapun URLnya, yang dibuka ya hanya `index.html`.\n\nKemudian, kita buat `server.go` yang isinya:\n\n```go\npackage main\nimport (\n\t\"net/http\"\n\t\"fmt\"\n\tspa \"github.com/roberthodgen/spa-server\"\n)\nfunc main(){\n\tfmt.Println(\"Buka localhost:2020\")\n\thttp.ListenAndServe(\":2020\", spa.SpaHandler(\"public\", \"index.html\"))\n}\n```\n\nMaksud dari kode di atas adalah, _apapun URL yang terbuka_ yang diakses oleh server, tetap `public/index.html`. Lalu, file tersebut dijalankan di `localhost:2020`.\n\nKemudian, jalankan perintah:\n\n```bash\ngo build server.go\n```\n\nMaka, akan tercipta file `server` yang merupakan hasil compile dari script Go tadi. Nah, ini nggak perlu pakai Go lagi untuk menjalankan. Tinggal dijalankan dengan `./server`."}