{"judul":"Tentang belajar mandiri","deskripsi":"Menerapkan sistem perkuliahan secara mandiri","isi":"> **TL;DR** Banyak membaca\n\nApakah itu belajar? Mengapa kita terus harus belajar padahal usia telah senja? Mengapa orang yang sudah dewasa terus saja belajar hingga S3? Tidakkah cukup pelajaran di pendidikan dasar kita? Apakah tidak rugi waktu yang dihabiskan untuk belajar?\n\nRasul bersabda:\n\nاطلب العلم من المهد إلى اللهد\n\n_Tuntutlah ilmu dari kelahiran hingga kematian_\n\nطلب العلم فريضة على كل مسلم\n\n_Menuntut ilmu wajib bagi setiap muslim_\n\nAdapun ilmu yang wajib dipelajari adalah ilmu agama karena dengan dialah kita hidup dan dengan dia pulalah kita menelusuri alam kematian kelak. Namun, menuntut atau mempelajari ilmu dunia juga nggak salah karena dengan ilmu dunia yang kita pelajari ini lah kita bisa berbuat kebaikan kepada sesama. Misalnya saja kita mempelajari ilmu psikologi, lalu dengan ilmu yang kita miliki itu bisa membuat banyak orang menjalani kehidupan dengan semangat, jauh dari pikiran ingin bunuh diri, lepas dari stres, trauma, fobia, dan kecemasan lainnya. Atau, misalnya aja kita punya ilmu kedokteran. Lalu, dengan ilmu itu, kita membantu banyak orang untuk hidup sehat, hidup yang penuh semangat, selalu penuh dengan pikiran positif. Bukankah itu semua baik?\n\nNah, tentu saja harus ada ilmunya untuk bisa membantu orang lain. Setidaknya kan, kepala ini ada isinya gitu loh. Kalau nggak ada isinya, kita nggak kepikiran untuk melakukan kebaikan kepada sesama. Maka, kita harus banyak **membaca** supaya kita memiliki ilmu yang dengan ilmu itu kita bisa membantu orang lain. Apalagi kan di masa pandemi seperti ini, kita nggak bisa bertemu dengan guru secara langsung, segalanya serba online. Di kampus-kampus aja pembelajarannya secara online. Sehingga, ilmu yang didapatkan itu nggak bisa semaksimal seperti kita bertemu langsung tatap muka menimba ilmu dengan guru. \n\nMaka, keaktifan setiap mahasiswa itu diperlukan untuk memperkaya wawasannya akan ilmu yang dimilikinya. Maka, buku itu penting untuk banyak dibaca, nggak usah dilihat seberapa tebal buku yang sedang dibaca. Entah itu bukunya tipis atau tebal, asalkan bermanfaat, maka itu lebih baik daripada kita memiliki koleksi buku sebanyak perpustakaan daerah tapi nggak nggak pernah dibaca."}