{"judul":"Tips mengikuti Hacktoberfest","deskripsi":"Yuk semarakkan festival tahunan para developer dunia!","isi":"Hacktoberfest adalah suatu festival pemrograman tingkat dunia yang diselenggarakan di bulan Oktober, tentu sudah terlihat dari namanya: Hacktoberfest = Hack + October. Nah, festival di bulan Oktober ini adalah festival FOSS (free open source software). Jadi, tantangannya adalah mengedit proyek-proyek open source yang ada di Github.\n\nMengapa hanya Github? Karena memang itu saja yang diminta oleh Hacktoberfest. Jadi, nanti sistem akan menilai secara otomatis, siapa saja yang sudah berkontribusi di Github minimal tiga proyek. Nah, ketika sudah berkontribusi di tiga proyek, maka sudah dianggap tuntas tantangan Hacktoberfest. Mudah kan? Tapi yang jadi permasalahan adalah proyek apa aja yang mau kita berkontribusi di dalamnya? Nah, aku ada salah satu solusi yang bisa dicoba.\n\n## Solusi ketika bingung mau berkontribusi di mana saat Hacktoberfest\n\nKamu bisa berkontribusi berbagai macam proyek open source berbentuk halaman website di JS.ORG. Aku nggak promosi ya. Tapi memang ini cara yang mudah kok. Pertama, kamu buka aja [cname_active.js di JS.ORG](https://github.com/js-org/js.org/blob/master/cnames_active.js). Di situ, kamu akan menemukan banyak link menuju proyek-proyek open source. Contohnya aja seperti di bawah ini:\n\n```javascript\nvar cnames_active = {\n  \"\": \"js-org.github.io\",\n  \"01mz\": \"01mz.github.io\",\n  \"100dayz\": \"deadcoder0904.github.io/100dayz\",\n  \"101\": \"7anshuai.github.io/js101\", // noCF? (don´t add this in a new PR)\n  \"131\": \"netrvin.github.io\",\n  \"140513\": \"140513.github.io\",\n  \"1c\": \"oknosoft.github.io/1c\",\n  \"21cm\": \"21cm.github.io\",\n  \"23chemistrycamp\": \"nchuchemistry.github.io/23chemistrycamp\",\n  \"2tube\": \"you2php.github.io/you2php\",\n  \"360\": \"360daili.github.io/360daili\",\n  \"3d-go\": \"3d-go.netlify.com\",\n  \"404\": \"licshee.github.io/404\",\n  ...\n}\n```\n\nDi file itu ada 2.582 baris saat diakses hari ini (22/9/2020). Nah, dari sekian banyak itu, kamu bisa memilih satu proyek secara acak. Misalnya aja, aku tertarik nih sama proyek `404` yang kalau di contoh di atas:\n\n```javascript\n\"404\": \"licshee.github.io/404\"\n```\n\nDari `licshee.github.io/404`, maka link Githubnya adalah `github.com/licshee/404`. Nah, tinggal kamu buka aja linknya, terus diedit-edit. Gitu aja.\n\n## Aku udah buat toolsnya\n\nLangsung cek aja <https://mzaini30.js.org/hacktoberfest-finder/>"}